{
  "TerrSet software": {
    "description": "TerrSet (formerly IDRISI) is a comprehensive integrated GIS and remote sensing software developed by Clark Labs. <a href='https://www.clarklabs.org/terrset/' target='_blank'>Visit the TerrSet website</a> for more information. It includes the Land Change Modeler (LCM) module specifically designed for land cover change analysis and prediction. TerrSet supports the full modeling workflow from change analysis and driver variable preparation to transition potential modeling using neural networks or logistic regression, and finally spatial allocation of future change. The software provides a user-friendly interface with extensive documentation and is widely used in academic and applied research.",
    "why": "TerrSet is recommended for your analysis because it provides an integrated, end-to-end solution for land cover change modeling with strong support for both demand and vulnerability assessment. The Land Change Modeler handles multi-layer perceptron neural networks for modeling complex relationships between drivers and change, includes built-in validation tools, and can work with both local and global datasets. While it is commercial software requiring a license, it offers excellent technical support and extensive training materials. TerrSet is particularly well-suited when you need a comprehensive, well-documented tool with proven methods and don't require extensive custom scripting.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "Dinamica EGO": {
    "description": "Dinamica EGO (Environment for Geoprocessing Objects) is a free, open, flexible software platform for environmental modeling, widely used to simulate land-use and land-cover change (LUCC). <a href='https://csr.ufmg.br/dinamica/' target='_blank'>Visit the Dinamica EGO website</a>. It enables users to construct spatially explicit models of landscape dynamics, from simple static maps to complex iterative simulations with feedback loops. The platform has been applied to modeling deforestation, urban expansion, agricultural encroachment, fires, and other disturbances. Dinamica EGO uniquely models both non-spatial aspects of land-cover change (total quantity) and spatial patterns (location and arrangement) using a Weights-of-Evidence approach combined with cellular automata for realistic spatial allocation.",
    "why": "Dinamica EGO is recommended because it provides sophisticated spatial pattern modeling through its cellular automata engine with Expander and Patcher functions, allowing you to match observed landscape structures (patch size, clustering, fragmentation). The Weights-of-Evidence approach efficiently handles multiple driver variables and provides probabilistic suitability maps. As free, open software with extensive documentation and a strong user community, it offers powerful capabilities for both demand estimation (through transition matrices) and spatial allocation. Dinamica EGO includes built-in validation tools like multi-scale fuzzy similarity measures (Reciprocal Similarity) for evaluating model performance. It's particularly well-suited when you need to model realistic spatial patterns of change and have the technical capacity to work with a visual programming environment.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "MOLUSCE software": {
    "description": "MOLUSCE (Modules for Land Use Change Evaluation) is a free, open-source QGIS plugin for land cover change analysis and modeling. <a href='https://github.com/nextgis/molusce' target='_blank'>View MOLUSCE on GitHub</a>. It provides tools for analyzing historical land cover transitions, identifying drivers of change, and projecting future change using various modeling algorithms including logistic regression, artificial neural networks, and cellular automata. MOLUSCE integrates seamlessly with QGIS, allowing you to leverage QGIS's extensive spatial analysis capabilities alongside change modeling.",
    "why": "MOLUSCE is recommended because it offers a free, accessible solution that integrates with your existing QGIS workflow. As open-source software, it provides transparency in methods and can be customized if needed. MOLUSCE is well-suited for your data availability and modeling requirements, offering multiple algorithms to choose from based on your specific needs. It handles the complete modeling workflow from transition analysis through driver variable preparation to future projection. While it may have a steeper learning curve than commercial alternatives and less extensive documentation, it provides powerful capabilities at no cost and benefits from an active user community.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "R lulcc package": {
    "description": "The lulcc package in R provides a flexible framework for spatially explicit land use and land cover change modeling. <a href='https://cran.r-project.org/web/packages/lulcc/index.html' target='_blank'>View lulcc on CRAN</a>. It implements demand-driven allocation models where total change (demand) is allocated across space based on suitability/vulnerability surfaces. The package supports multiple allocation algorithms and allows for complex modeling scenarios including multiple land use types, elasticity parameters, and neighborhood effects. As an R package, it integrates with R's extensive statistical and spatial analysis ecosystem.",
    "why": "The R lulcc package is recommended for your analysis because it provides maximum flexibility and customization for advanced users comfortable with R programming. <a href='https://cran.r-project.org/web/packages/lulcc/vignettes/lulcc.html' target='_blank'>Read the lulcc vignette</a> for detailed documentation. This package is particularly well-suited when working with global datasets, as it can handle large spatial extents efficiently. It allows you to implement custom allocation rules, integrate external models for demand estimation, and leverage R's powerful data manipulation and visualization capabilities. While it requires programming skills and more hands-on model development, it offers unparalleled control over the modeling process and can be integrated into reproducible research workflows.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "Conversion Pressure Index": {
    "description": "The Global Conversion Pressure Index is a spatially explicit dataset that quantifies the relative risk of natural habitat conversion based on multiple anthropogenic pressure factors. It integrates data on human population density, accessibility (roads, navigable rivers), agricultural suitability, and existing land use patterns to identify areas where conversion pressure is highest. The index is available globally at 1km resolution and provides a ready-to-use vulnerability surface for conversion risk modeling without requiring custom driver analysis.",
    "why": "This product is recommended because you are modeling degradation where past patterns are not reliable predictors of future risk. The Conversion Pressure Index uses current conditions and structural factors (accessibility, suitability) rather than historical change patterns, making it appropriate when drivers are shifting or when you lack historical data. It provides a standardized, globally consistent assessment that can be used directly in your analysis. The index is particularly useful for rapid assessments or when you need consistent methods across large areas.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "Human Modification Index": {
    "description": "The Global Human Modification (gHM) index quantifies the cumulative intensity of human modification of terrestrial lands globally at 1km resolution. It integrates multiple anthropogenic stressors including human settlement, agriculture, transportation, mining, and energy production into a single 0-1 index. Forecast versions of gHM project future human modification by extrapolating historical trends in each stressor component, providing spatially explicit predictions of where and how intensely human pressure will increase.",
    "why": "The Human Modification Forecast is recommended because you are modeling degradation where past patterns provide a reliable indicator of future trends. Unlike categorical land cover change, the gHM captures gradual intensification of human impacts, making it ideal for degradation modeling. The forecast assumes continuation of historical trajectories in human pressure, which is appropriate when you expect existing drivers to persist. This product is ready-to-use and provides a comprehensive measure of human pressure that correlates well with biodiversity loss and ecosystem degradation.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "ESRI land cover change": {
    "description": "ESRI provides annual global land cover maps at 10m resolution derived from Sentinel-2 imagery using deep learning. The time series (2017-present) allows analysis of land cover transitions and calculation of change rates. These products offer unprecedented spatial detail for global-scale analysis and can be accessed through ESRI's Living Atlas or downloaded for offline analysis. The classification includes 10 land cover classes and provides confidence layers to assess prediction uncertainty.",
    "why": "ESRI land cover products are recommended for your global/continental scale conversion modeling based on historical patterns. The high spatial resolution (10m) provides much greater detail than traditional global products (30m-1km), allowing detection of smaller conversion events. The annual time series enables calculation of recent change rates that can be extrapolated forward. This approach assumes business-as-usual continuation of past patterns and is most appropriate for near-term projections (5-20 years) where drivers are expected to remain relatively stable. The products integrate well with ESRI's ArcGIS platform if you use that ecosystem.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  },
  "Chen 2020 / Demeter": {
    "description": "The Chen et al. (2020) dataset provides spatially explicit land use projections at 0.25° resolution for multiple IPCC scenarios through 2100. These projections are generated using the Demeter land use allocation model, which downscales outputs from Integrated Assessment Models (IAMs) to create gridded maps of cropland, pasture, urban areas, and natural vegetation. The dataset includes multiple RCP scenarios (2.6, 4.5, 6.0, 8.5) representing different climate policy and socioeconomic development pathways.",
    "why": "This dataset is recommended because you want to explore scenario-based futures at global/continental scale rather than simply extrapolating past trends. The Chen 2020/Demeter projections integrate complex socioeconomic models with climate scenarios, allowing you to assess how land use might evolve under different policy choices, population growth rates, and technological developments. This is particularly valuable for long-term planning (2050-2100), climate change impact assessments, or exploring the range of plausible futures. The multiple scenarios enable uncertainty analysis and identification of robust strategies that perform well across different futures.",
    "download": "XXXX",
    "tutorial": "XXXX",
    "documentation": "XXXX"
  }
}
